;*****************************************************************************;
;            Language set file for plugins used by NativeLang.dll             ;
;*****************************************************************************;
;                                                                             ;
; Please change the file and distribute to the corresponding developer.       ;
;                                                                             ;
;*****************************************************************************;


; Spell-Checker Language Set *************************** jens.plugin.npp@gmx.de
[SpellChecker.dll NppMenu]
Main="&Spell-Checker"
0="&Spell-Checker...%tStrg+Alt+Shift+S"
1="&Help..."
2="&How to use...%tStrg+Alt+Shift+S"

[SpellChecker.dll Spell-Checker]
Caption="Spell-Checker"
2="Cancel"
1102="&Learn"
1103="&Replace"
1104="&Ignore"
1105="Ignore &All"
1107="Current word:"
1109="Original text:"
1110="Replace by:"
1111="Language:"

[SpellChecker.dll Help]
Caption="Help"
1205="Author:"
1206="eMail:"
1207="Installation:"
1208="Check out for new plugins and updates on:"
1209="Spell-Checker uses GNU Aspell an Open Source product:"
1210="Menu entries"
1211="Spell-Checker...%t%tStarts checking of (selected) text."
1212="Help...%t%t%tShows this help dialog."

[SpellChecker.dll NotAvailable]
Caption="How to use Spell-Checker"
1302="GNU Aspell and/or dictionaries are missing.%nDownload installation files here:"
1303="If Aspell is allready installed, do correction of%nrelative path to aspell-15.dll and restart:"

[SpellChecker.dll Text]
MsgBox RectMode="Checking of misspelling is not possible in rectangle mode!%tSpell-Checker"
MsgBox Done="Done%tSpell-Checker"
